InformationRegisters/КанбанДоски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДоски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Comment>0 без разделителей, 1 Проект, 2 Сотрудник</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКартинкиКорзины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанДорожки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДорожки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Общая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКолонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКолонки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПриПопадании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйПереход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйУход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омКанбанОбщие/Ext/Module.bsl
Функция ПолучитьСтруктураКанбана(НаименованиеДоски) Экспорт
	
	СтруктураДоски = Новый Структура("УИДДоски, Наименование, НомерВерсии, ПутьКФайлуКартинкиКорзины, ПерваяЗагрузка, Отбор", "", "", 0, "", Истина, Неопределено);
	
	СтруктураКанбана = Новый Структура("СтруктураДоски, мКолонки, мДорожки", СтруктураДоски, Новый Массив, Новый Массив);
	
	ИмяДоскиДляТЗ = омКанбанДоскиНаСервереПовтор.ПолучитьИмяДоски(НаименованиеДоски);
	
	Если ПустаяСтрока(ИмяДоскиДляТЗ) Тогда
		Возврат СтруктураКанбана;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КанбанДоски.УИД КАК УИДДоски,
	|	КанбанДоски.Наименование КАК Наименование,
	|	КанбанДоски.НомерВерсии КАК НомерВерсии,
	|	КанбанДоски.ИмяКартинкиКорзины КАК ИмяКартинкиКорзины
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.КанбанДоски КАК КанбанДоски
	|ГДЕ
	|	КанбанДоски.Наименование = &Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КанбанДорожки.УИД КАК УИД,
	|	КанбанДорожки.Наименование КАК Наименование,
	|	КанбанДорожки.Цвет КАК Цвет,
	|	КанбанДорожки.ЛимитКарточек КАК ЛимитКарточек
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДорожки КАК КанбанДорожки
	|		ПО вт.УИДДоски = КанбанДорожки.Доска
	|
	|УПОРЯДОЧИТЬ ПО
	|	КанбанДорожки.НомерПоПорядку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КанбанКолонки.УИД КАК УИД,
	|	КанбанКолонки.ИмяСобытия КАК ИмяСобытия,
	|	КанбанКолонки.ЛимитКарточек КАК ЛимитКарточек,
	|	КанбанКолонки.ЛимитЧасов КАК ЛимитЧасов,
	|	КанбанКолонки.Наименование КАК Наименование,
	|	КанбанКолонки.Цвет КАК Цвет,
	|	КанбанКолонки.ЗапрещенИнтерактивныйПереход КАК ЗапрещенИнтерактивныйПереход,
	|	КанбанКолонки.ЗапрещенИнтерактивныйУход КАК ЗапрещенИнтерактивныйУход
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
	|		ПО вт.УИДДоски = КанбанКолонки.Доска
	|
	|УПОРЯДОЧИТЬ ПО
	|	КанбанКолонки.НомерПоПорядку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.УИДДоски КАК УИДДоски,
	|	вт.Наименование КАК Наименование,
	|	вт.НомерВерсии КАК НомерВерсии,
	|	вт.ИмяКартинкиКорзины КАК ИмяКартинкиКорзины
	|ИЗ
	|	вт КАК вт";
	
	Запрос.УстановитьПараметр("Наименование", ИмяДоскиДляТЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл  
		СтруктураДорожки = Новый Структура("УИД, ИмяСобытия, ЛимитКарточек,  Наименование, Цвет", );
		ЗаполнитьЗначенияСвойств(СтруктураДорожки, Выборка);
		СтруктураКанбана.мДорожки.Добавить(СтруктураДорожки);
	КонецЦикла;
	
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл  
		СтруктураКолонки = Новый Структура("УИД, ИмяСобытия, ЛимитКарточек, ЛимитЧасов, Наименование, Цвет, ЗапрещенИнтерактивныйПереход, ЗапрещенИнтерактивныйУход", );
		ЗаполнитьЗначенияСвойств(СтруктураКолонки, Выборка);
		СтруктураКанбана.мКолонки.Добавить(СтруктураКолонки);
	КонецЦикла;
	
	Выборка = Результат[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураКанбана.СтруктураДоски, Выборка);
		
		Если НЕ ПустаяСтрока(Выборка.ИмяКартинкиКорзины) И ПустаяСтрока(СтруктураКанбана.СтруктураДоски.ПутьКФайлуКартинкиКорзины) Тогда
			
			ПутьКФайлу = КаталогВременныхФайлов() + Выборка.ИмяКартинкиКорзины + ".png";
			Файл = Новый Файл(ПутьКФайлу); 
			Если НЕ Файл.Существует() Тогда
				БиблиотекаКартинок[Выборка.ИмяКартинкиКорзины].Записать(ПутьКФайлу);	
			КонецЕсли; 
			
			СтруктураКанбана.СтруктураДоски.ПутьКФайлуКартинкиКорзины = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
			
			УдалитьФайлы(ПутьКФайлу);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураКанбана;
	
КонецФункции // ПолучитьУИДДДоски()
